{
  "menu": {
    "main": "INTRO",
    "about": "ABOUT ME",
    "projects": "PROJECTS",
    "contact": "CONTACT",
    "skills": "SKILLS"
  },
  "intro": "TypeScript? React? Of course I know them - I use them daily. Backend too, as long as we're talking about Node or Django. When it comes to version control I'd say GitHub. Visit this page on mobile device or use dev tools to experience my way of Responsive Web Design",
  "description": {
    "intro": {
      "head": "This is me.",
      "desc": "A young web developer from Poland, looking for an opportunity."
    },
    "main": {
      "title": "Few years ago, I set myself a lifegoal - to become THE web developer.",
      "body": "This goal of mine has not changed, I'm still here learning new technologies and solutions to modern web problems, still finding new ways of optimizing code and discovering new UI/UX designs.",
      "extend": "Be it a Single Page Application or a multi page app that utilises templating engine, i know how to build it and will quickly learn how to maintain it."
    }
  },
  "project-intro": "My projects:",
  "projects": {
    "bella": "Bella Ciao is name of the fictional restaurant for which I made a webapp using NextJS and MongoDB",
    "bella-ext": "This project was a way into NextJS for me and the timing couldn't have been better. It was a time when client/server components and app router were not yet declared stable and production ready, so I learned pages routing and getServerSideProps data fetching. But as time passed on these previously mentioned features were declared production ready so I decided to refactor what I had around them. The app is hosted on Vercel, the database (holding restaurant menu items) as mentioned is hosted on MongoDB. This project also helped me get a much better grasp of TypeScript.",
    "bella-tech": "Tools used: NextJS, TypeScript, MongoDB, CSS Modules",
    "portfolio": "The website showcasing my personal projects, made with Vite.",
    "portfolio-ext": "After Bella Ciao I decided that I want more styling practice and went with SPA Portfolio and chose to use and learn SASS. Eventually I also incorporated styled components into the project.",
    "portfolio-tech": "Tools used: Vite, TypeScript, React, SASS, CSS-in-JS",
    "szybka": "Simple website to check weather in a specified city",
    "szybka-ext": "Szybka Pogoda was one of my first websites when I started learning React, Material UI and API data fetching. Here after user enters a city name, the app fetches weather data from AccuWeather API and displays the most important information. The app has been deployed on Firebase",
    "szybka-tech": "Tools used: Vite, Firebase, AccuWeather API, Material UI"
  },
  "contact": {
    "intro": "Contact me"
  }
}