{
  "menu": {
    "main": "POCZĄTEK",
    "about": "O MNIE",
    "projects": "PROJEKTY",
    "contact": "KONTAKT",
    "skills": "UMIEJĘTNOŚCI"
  },
  "intro": "TypeScript? React? Oczywiście że je znam - używam ich codziennie. Backend też, a tak dokładniej to Node lub Django. Jeśli chodzi o kontrolę wersji preferuję GitHub. Odwiedź tę stronę na urządzeniu mobilnym lub użyj DevTools by sprawdzić moją kompetencję w tworzeniu responsywnych aplikacji",
  "description": {
    "intro": {
      "head": "To jestem ja.",
      "desc": "Młody web developer z polski, który szuka okazji do rozwinięcia skrzydeł."
    },
    "main": {
      "title": "Kilka lat temu obrałem w życiu cel - zostać mistrzowskim web developerem",
      "body": "Ten cel się nie zmienił, wciąż uczę się nowych technologii oraz rozwiązań, wciąż znajduje nowe sposoby optymalizacji kodu oraz odnajduję nowoczesne schematy UI/UX",
      "extend": "Niezależnie czy jest to aplikacja typu SPA czy aplikacja wielostronicowa stworzona przy użyciu systemu szablonów, wiem jak ją stworzyć i szybko nauczę się utrzymać ją w idealnym stanie."
    }
  },
  "project-intro": "Moje projekty:",
  "projects": {
    "bella": "Bella Ciao to nazwa fikcyjnej restauracji której stworzyłem aplikację internetową używając NextJS oraz MongoDB.",
    "bella-ext": "Ten projekt był dla mnie wprowadzeniem do NextJS, i trafiłem na najlepszy możliwy okres do nauki. Był to czas gdy NextJS przechodził zmiany routingu oraz pobierania danych. Jako iż nowe zmiany nie były gotowe do użycia w produkcji, nauczyłem się wtedy używanych metod takich jak routing na podstawie folderu pages lub getServerSideProps. Z czasem zmiany zostały przygotowane do użycia w produkcji, więc nauczyłem się ich i przerobiłem wokół nich ten projekt. Aplikacja jest hostowana na stronie Vercel, baza danych (trzymająca pozycje menu restauracji) jak wcześniej wspomniałem znajduje się na MongoDB. Praca nad tą aplikacją bardzo pomogła mi w opanowaniu TypeScripta.",
    "bella-tech": "Użyte narzędzia: NextJS, TypeScript, MongoDB, Moduły CSS",
    "portfolio": "Aplikacja prezentująca moje osobiste projekty, stworzona przy użyciu Vite.",
    "portfolio-ext": "Po skończeniu Bella Ciao zdecydowałem się na projekt przy którym mógłbym skupić się na rozwijaniu moich zdolności stylowania, więc wybrałem SPA Portfolio z użyciem SASS. Z czasem zacząłem też używać styled components.",
    "portfolio-tech": "Użyte narzędzia: Vite, TypeScript, React, SASS, CSS-in-JS",
    "szybka": "Prosta aplikacja którą można sprawdzić pogodę w wybranym mieście",
    "szybka-ext": "Szybka Pogoda to jedna z moich początkowych stron podczas nauki Reacta, Material UI oraz fetchowania danych z API, w tym przypadku AccuWeather City API. Po wpisaniu nazwy miasta, aplikacja pobiera informacje o pogodzie i wyświetla te najważniejsze. Hostowana przy użyciu Firebase",
    "szybka-tech": "Użyte narzędzia: Vite, Firebase, AccuWeather API, Material UI"
  },
  "contact": {
    "intro": "Kontakt"
  }
}